/**
 * @defgroup 
 * @file 
 * @brief 管理overlay输出
 * @author cjh
 * @version v1.0.0
 * @date 2024年9月20日
 */

#ifndef __OVERLAYMANAGER_H__
#define __OVERLAYMANAGER_H__

#ifdef __cplusplus
extern "C"{
#endif /* _cplusplus */

#include "typedef.h"
#include "Media.h"



#define BANNER_CHANNEL_NUM	2
#define BANNER_NUM	    10
#define BANNER_TOTAL	BANNER_CHANNEL_NUM * BANNER_NUM

typedef struct
{
	INT32	plane_index;			
	INT32	VoId;
//	UINT32	fb_id;
	UINT32	index;
	UINT32	uiTimestamp_draw[BANNER_TOTAL];/*滚动进度*/
}T_Overlay;


typedef struct
{
	UINT32  uiChId;
	UINT32	index;
	UINT32	uiTimestamp_draw[BANNER_NUM];/*滚动进度*/
}T_OverlayMergeInfo;



typedef struct
{
	struct sp_bo *bo;
}T_OverlayPlayMergeInfo;


E_StateCode OverlayManager_Stop();
E_StateCode OverlayManager_Start();
/**********************************************************************
* 函数名称：OverlayManager_ModInit
* 功能描述：模块初始化
* 输入参数：无
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
int OverlayManager_ModInit();

/**********************************************************************
* 函数名称：OverlayManager_ModUninit
* 功能描述：模块反初始化
* 输入参数：无
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
int OverlayManager_ModUninit();

/**********************************************************************
* 函数名称：OverlayManagerAddPlayInfo
* 功能描述：添加横幅服务待播放信息
* 输入参数：T_Overlay
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode OverlayManagerAddPlayInfo(T_OverlayPlayInfo* playinfo);

/**********************************************************************
* 函数名称：MOChCreateBanner
* 功能描述：创建一条横幅
* 输入参数：T_DisplayBanner
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode MOChCreateBanner(T_DisplayBanner *tSetup);

/**********************************************************************
* 函数名称：MOChDeleteBanner
* 功能描述：删除一条横幅
* 输入参数：T_BannerAction
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode MOChDeleteBanner(T_WindowCommonCtrl *tSetup);

/**********************************************************************
* 函数名称：MOChUpdateBanner
* 功能描述：更新一条横幅
* 输入参数：T_DisplayBanner
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode MOChUpdateBanner(T_DisplayBanner *tSetup);

/**********************************************************************
* 函数名称：MOChStartBanner
* 功能描述：滚动横幅启动
* 输入参数：T_BannerAction
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode MOChStartBanner(T_WindowCommonCtrl *tSetup);

/**********************************************************************
* 函数名称：MOChStartBanner
* 功能描述：滚动横幅暂停
* 输入参数：T_BannerAction
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode MOChStopBanner(T_WindowCommonCtrl *tSetup);

/**********************************************************************
* 函数名称：MOChStartBanner
* 功能描述：获取滚动横幅进度
* 输入参数：T_MChWindowBuffer
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode MOChGetBannerInfo(T_WindowBufferReq *tSetup);

/**********************************************************************
* 函数名称：MOChStartBanner
* 功能描述：设置滚动横幅进度
* 输入参数：T_MChWindowBuffer
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode MOChSetBannerInfo(T_WindowPlayCtrl *tSetup);

/**********************************************************************
* 函数名称：MOChStartBanner
* 功能描述：冻结滚动横幅进度
* 输入参数：T_MChWindowBuffer
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode MOChFreezeBnrChannel(T_WindowCommonCtrl *tSetup);

/**********************************************************************
* 函数名称：MOChStartBanner
* 功能描述：解冻滚动横幅进度
* 输入参数：T_MChWindowBuffer
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode MOChUnFreezeBnrChannel(T_WindowCommonCtrl *tSetup);

/**********************************************************************
* 函数名称：MOChStartBanner
* 功能描述：修改多条横幅
* 输入参数：T_MChWindowBuffer
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode MOChOpenMultiBanner(T_DisplayBanner *tSetup, UINT32 num, UINT32 uiChId);

/**********************************************************************
* 函数名称：MOChStartBanner
* 功能描述：设置输出口绑定的图层索引号准备输出内容
* 输入参数：T_MChWindowBuffer
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode OverlayManager_SetPlaneInfo(UINT32 pPlaneIndex, UINT32 voId, T_OverLayFB* fbinfo);

/**********************************************************************
* 函数名称：MOChStartBanner
* 功能描述：设置输出口绑定的图层索引号销毁输出内容
* 输入参数：T_MChWindowBuffer
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode OverlayManager_FreePlaneInfo();

/**********************************************************************
* 函数名称：MOChStartBanner
* 功能描述：获取滚动横幅共享内存
* 输入参数：T_MChWindowBuffer
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/
E_StateCode OverlayManagerCreatScrollBanner(T_OverlayScroll_Info * info);

/**********************************************************************
* 函数名称：MOChStartBanner
* 功能描述：打印横幅信息
* 输入参数：uiChId
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/

E_StateCode MOChPrintMultiBannerInfo(UINT32 uiChId);


/**********************************************************************
* 函数名称：MOChStartBanner
* 功能描述：刷新所有横幅
* 输入参数：uiChId
* 输出参数：无
* 返 回 值：	 状态码
* 其它说明： 
* 修改日期        版本号     修改人	      修改内容
* -----------------------------------------------
* 2024/12/27	     V1.0	           chengjiahao
***********************************************************************/

E_StateCode OverlayManagerFleshBanners();

/*????*/

#ifdef __cplusplus
}
#endif /* _cplusplus */

#endif /* __OVERLAYMANAGER_H__ */

